<script lang="ts" setup>
</script>

<template>
  <div class="flex h-full dark:bg-neutral-800">
    <div class="px-4 m-auto space-y-4 text-center max-[400px]">
      <header class="space-y-2">
        <h2 class="text-base font-bold text-center text-slate-400 dark:text-neutral-200">
          用户协议
        </h2>
        <h3 class="text-base font-bold  text-center text-slate-400 dark:text-neutral-200">
          更新日期：2023年5月21日
        </h3>
        <h3 class="text-base font-bold text-center text-slate-400 dark:text-neutral-200">
          生效日期：2023年5月21日
        </h3>
        <h2 class="text-base font-bold text-center text-slate-400 dark:text-neutral-200">
          协议使用范围
        </h2>
        <div class="disclaimer-container">
          <ul>
            <li>感谢您使用aiavip。本协议为您与本平台管理者之间所订立的契约，具有合同的法律效力，请您仔细阅读。</li>
            <li>
              自您确认接受之时起或自您使用aiavip行为发生之时起生效。 除非另有明确规定，平台新增的任何新功能、新产品、新服务，均无条件地适用本协议。
            </li>
          </ul>
        </div>
        <h2 class="text-base font-bold text-center text-slate-400 dark:text-neutral-200">
          一、免责声明
        </h2>
        <div class="disclaimer-container">
          <ul>
            <li>1.1 使用本服务时，请您确保您所输入的内容未侵害他人权益，未涉及不良信息及情色内容，同时未输入与政治相关的内容，且所有输入内容均合法合规。</li>
            <li>1.2 若平台发现您故意输入1.1中所含的内容，引导AI生成不良内容并进行传播造谣，对公司造成影响，我们有权对您的账号进行永久封禁并追究相关法律责任。</li>
            <li>1.3 您确认并知悉当前体验服务生成的所有内容均由人工智能模型生成，aiavip对其生成内容的准确性、完整性和功能性不做任何保证，并且其生成的内容均不代表我们的态度或观点。AI模型发出的信息是由计算机生成，可能是虚构的，也请您自行辨别是非。您在使用本平台咨询医疗、法律等相关问题时，本平台仅提供医疗建议和法律建议，不代表医疗服务法律服务或治疗。您在使用本平台前必须咨询医生和相关法律人士，对医疗和法律决定负最终责任。本平台的信息及服务应仅供参考，不构成医疗建议法律建议和治疗方式，我们不承担由使用本平台而产生的任何责任。</li>
            <li>1.4 您在同意接受本声明之前，具体的使用规范请严格按照《用户协议》的内容进行输入。</li>
            <li>1.5 无论您是否已实际阅读本声明，当您通过网络页面点击确认同意本声明或实际使用本平台（“我方”）提供的本服务时，均表示您与我方已就本声明达成一致并同意接受本声明的全部约定内容。如果您不同意本声明的任意内容，或者无法准确理解我方对本声明条款的解释，请点击不同意或停止使用本服务。否则即表示您已接受本申明所述的所有条款及其适用条件，同意受本声明约束。</li>
            <li>1.6 我们尊重并保护您及所有使用本服务用户的个人隐私，在此提醒您：请您确认使用本服务时输入的内容将不包含您本人及他人的个人信息。</li>
          </ul>
        </div>

        <h2 class="text-base font-bold text-center text-slate-400 dark:text-neutral-200">
          二、本协议内容、生效、变更
        </h2>
        <div class="disclaimer-container">
          <ul>
            <li>
              本协议内容包括协议正文及所有本平台已经发布的或将来可能发布的各类规则。所有规则为本协议不可分割的组成部分，与协议正文具有同等法律效力。如您对协议有任何疑问，应向本平台咨询。您在同意所有协议条款并完成注册程序，才能成为本站的正式用户，您点击“同意并接受”按钮后，本协议即生效，对双方产生约束力。
              只要您使用本平台服务，则本协议即对您产生约束，届时您不应以未阅读本协议的内容或者未获得本平台对您问询的解答等理由，主张本协议无效，或要求撤销本协议。您确认：本协议条款是处理双方权利义务的契约，始终有效，法律另有强制性规定或双方另有特别约定的，依其规定。您承诺接受并遵守本协议的约定。如果您不同意本协议的约定，您应立即停止注册程序或停止使用本平台服务。本平台有权根据需要不定期地制订、修改本协议及／或各类规则，并在本平台公示，不再另行单独通知用户。变更后的协议和规则一经在网站公布，立即生效。如您不同意相关变更，应当立即停止使用本平台服务。您继续使用本平台服务的，即表明您接受修订后的协议和规则。
            </li>
          </ul>
        </div>
        <h2 class="text-base font-bold text-center text-slate-400 dark:text-neutral-200">
          三、注册
        </h2>
        <div class="disclaimer-container">
          <ul>
            <li>
              注册资格用户须具有法定的相应权利能力和行为能力的自然人、法人或其他组织，能够独立承担法律责任。您完成注册程序或其他本平台同意的方式实际使用本平台服务时，即视为您确认自己具备主体资格，能够独立承担法律责任。若因您不具备主体资格，而导致的一切后果，由您及您的监护人自行承担。
            </li>
            <li>
              只要您使用本平台服务，则本协议即对您产生约束，届时您不应以未阅读本协议的内容或者未获得本平台对您问询的解答等理由，主张本协议无效，或要求撤销本协议。您确认：本协议条款是处理双方权利义务的契约，始终有效，法律另有强制性规定或双方另有特别约定的，依其规定。您承诺接受并遵守本协议的约定。如果您不同意本协议的约定，您应立即停止注册程序或停止使用本平台服务。本平台有权根据需要不定期地制订、修改本协议及／或各类规则，并在本平台公示，不再另行单独通知用户。变更后的协议和规则一经在网站公布，立即生效。如您不同意相关变更，应当立即停止使用本平台服务。您继续使用本平台服务的，即表明您接受修订后的协议和规则。
            </li>
            <li>
              3.1 用户应自行诚信向本站提供注册资料，用户同意其提供的注册资料真实、准确、完整、合法有效，用户注册资料如有变动的，应及时更新其注册资料。如果用户提供的注册资料不合法、不真实、不准确、不详尽的，用户需承担因此引起的相应责任及后果，并且本平台保留终止用户使用本平台各项服务的权利。
            </li>
            <li>
              3.2 用户在本站进行浏览等活动时，如果涉及用户真实姓名/名称、通信地址、联系电话、电子邮箱等隐私信息的，本站将予以严格保密，除非得到用户的授权或律另有规定，本站不会向外界披露用户隐私信息。
            </li>
          </ul>
        </div>

        <h2 class="text-base font-bold text-center text-slate-400 dark:text-neutral-200">
          四、账户
        </h2>
        <div class="disclaimer-container">
          <ul>
            <li>4.1 您使用微信登录或者设备登录（ios）注册成功后，将持有本平台唯一编号的账户信息。</li>
            <li>
              4.2 您应谨慎合理的保存、使用您的登录账户信息，应对通过您的账户信息实施的行为负责。除非有法律规定或司法裁定，且征得本平台的同意，否则，用户信息不得以任何方式转让、赠与或继承（与账户相关的财产权益除外）。用户不得将在本站注册获得的账户借给他人使用，否则用户应承担由此产生的全部责任，并与实际使用人承担连带责任。
            </li>
            <li>
              4.3 如果发现任何非法使用等可能危及您的账户安全的情形时，您应当立即以有效方式通知本平台要求暂停相关服务，并向公安机关报案。您理解本平台对您的请求采取行动需要合理时间，本平台对在采取行动前已经产生的后果（包括但不限于您的任何损失）不承担任何责任。
            </li>
          </ul>
        </div>

        <h2 class="text-base font-bold text-center text-slate-400 dark:text-neutral-200">
          五、用户信息的合理使用
        </h2>
        <div class="disclaimer-container">
          <ul>
            <li>
              5.1 您了解并同意，本平台有权应国家司法、行政等主管部门的要求，向其提供您在本平台填写的注册信息和交易记录等必要信息。如您涉嫌侵犯他人知识产权，则本平台亦有权在初步判断涉嫌侵权行为存在的情况下，向权利人提供您必要的身份信息。
            </li>
            <li>
              5.2 用户同意本平台有权使用用户的注册信息、用户名等信息，登陆进入用户的注册账户，进行证据保全，包括但不限于公证、见证等。
            </li>
          </ul>
        </div>

        <h2 class="text-base font-bold text-center text-slate-400 dark:text-neutral-200">
          六、服务使用协议
        </h2>
        <div class="disclaimer-container">
          <ul>
            <li>
              6.1 您承诺将严格依照本声明使用本服务，并且不会利用本服务进行任何违法或不当的活动，发布、传送或分享含有下列内容之一的信息：
              <ul>
                <li>
                  (1) 反对宪法所确定的基本原则的；
                </li>
                <li>
                  (2) 危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；
                </li>
                <li>
                  (3) 损害国家荣誉和利益的；
                </li>
                <li>
                  (4) 煽动民族仇恨、民族歧视、破坏民族团结的；
                </li>
                <li>
                  (5) 破坏国家宗教政策，宣扬邪教和封建迷信的；
                </li>
                <li>
                  (6) 散布谣言，扰乱社会秩序，破坏社会稳定的；
                </li>
                <li>
                  (7) 散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；
                </li>
                <li>
                  (8) 侮辱或者诽谤他人，侵害他人合法权利的；
                </li>
                <li>
                  (9) 含有虚假、诈骗、有害、胁迫、侵害他人隐私、骚扰、侵害、中伤、粗俗、猥亵、或其它道德上令人反感的内容；
                </li>
                <li>
                  (10) 含有中国或其您所在国国家管辖法所适用的法律、法规、规章、条例以及任何具有法律效力之规范所限制或禁止的其它内容的。 您应当对使用本服务是否符合法律法规规定进行必要审查，并由您承担由此产生的所有责任。您确认并同意，我方不会因为本服务或您使用本服务违反上述约定，而需要承担任何责任。
                </li>
              </ul>
            </li>
            <li>
              6.2 您应当对使用本服务是否符合法律法规的相关规定进行必要审查，您本人将承担由此产生的所有责任。您确认并同意，我方不会因为本服务或您使用本服务违反上述约定，而需要承担任何责任。
            </li>
            <li>
              6.3 您使用本服务时不得侵害他人权益（包括但不限于著作权、专利权、商标权、肖像权等知识产权与其他权益）。同时您同意并承诺，您使用本服务所提供、使用的文本内容已获得了充分、必要且有效的合法许可及授权。
            </li>
            <li>
              6.4 您同意并承诺在使用本服务时，不会披露任何保密、敏感或个人隐私等信息。
            </li>
            <li>
              6.5 您理解并同意，本服务仅处于体验、试用阶段，尚存在不完备性，我方不对任何服务可用性、可靠性做出任何承诺。我方不对您使用本服务或本服务结果承担任何责任，且本服务结果不代表我方立场。
            </li>
            <li>
              6.6 我方有权因为业务发展或法律法规的变动而随时对本服务的内容和/或提供方式进行变动，也可暂停或终止本服务。您同意我方将不对因上述情况导致的任何后果而向您或第三方承担任何责任。
            </li>
            <li>
              6.7 在任何情况下，我方均不会因本服务所发生的任何直接性、间接性、后果性、惩戒性、偶然性、特殊性的损害(包括但不限于：您使用本服务而遭受的利润损失)，承担任何责任(即使您已事先被告知该等损害发生的可能性)。
            </li>
            <li>
              6.8 若您违反本声明任何约定，则我方有权随时单方面终止本声明，且我方无需承担任何责任。同时我方有权根据实际损失向您请求赔偿。
            </li>
            <li>
              6.9 除双方另有约定外，本声明之解释与适用以及与本声明有关的争议，均依照中华人民共和国法律予以处理(不包含冲突法)，并由我方所在地有管辖权的人民法院管辖。
            </li>
          </ul>
          <h2 class="text-base font-bold text-center text-slate-400 dark:text-neutral-200">
            七、会员权益说明
          </h2>
          <div class="disclaimer-container">
            <ul>
              <li>
                7.1 我方为用户提供了增值服务，用户可以付费成为会员，获得区别于普通用户的功能和服务。您方承诺，支付成为会员用户即代表您同意并接受会员服务和权益，您所支付的费用，属于数字化商品，不适用无理由退款，一旦支付，费用将不予退还。（包括但不限于因不可抗力因素（包括但不限于自然灾害、社会事件、法律法规变更或者政府行为、通讯或者技术故障等）导致原会员功能无法继续使用；或者是个人对产品现有功能或者后续功能不满意等）。我们保证提供的服务绝对优质、高效、安全、可靠，同时我们会尽最大努力保障您的权益和满意度。
              </li>
              <li>
                7.2 会员类别包括但不限于：周会员、月会员、季度会员、年会员、终身会员。其中终身会员即代表aiavip正常运营期间，该用户都可以享受指定的会员服务。但不包括因政治、环境、其他包括非人力因素等导致的产品无法正常运营，则终身会员的服务也无法继续享受，敬请悉知。
              </li>
              <li>
                7.3 会员功能包括但不限于GPT3.5、GPT4.0等功能。其中会员的GPT4.0目前限制每天使用20次。如有修改请以产品端实际展示为准。会员功能可能会随时变化和更新，敬请悉知。
              </li>
            </ul>
          </div>
          <h2 class="text-base font-bold text-center text-slate-400 dark:text-neutral-200">
            八、知识产权
          </h2>
          <div class="disclaimer-container">
            <ul>
              <li>
                8.1 本平台的所有内容，包括但不限于文本、图形、标识、按钮图标、图像、音频片段、数字下载、数据编译和软件，均是本公司或其内容提供者的财产，受中国和国际版权法的保护。本公司的所有内容的汇编是本公司的排他财产，受中国和国际版权法的保护。本公司的所有软件都是本公司或其软件供应商的财产，受中国和国际版权法的保护。
              </li>
              <li>
                8.2 除非法律另有明确规定，未经本公司明确书面同意，任何单位或个人不得以任何方式或理由对本平台的任何部分或本平台的服务进行使用、复制、修改、复制、公开传播、更改、散布、发行或公开发表。违反上述声明者，本公司将追究其法律责任。
              </li>
            </ul>
          </div>
          <h2 class="text-base font-bold text-center text-slate-400 dark:text-neutral-200">
            九、责任限制
          </h2>
          <div class="disclaimer-container">
            <ul>
              <li>
                9.1 在法律允许的最大范围内，本平台在任何情况下都不对由于互联网正常的设备维护、互联网连接故障、计算机、通讯或其他系统的故障、电力故障、罢工、劳动争议、骚乱、起义、骚乱、缺乏或不可得到的原材料、火灾、洪水、风暴、爆炸、天灾、战争、政府行动、国内外法院或国内外其他有能力的法律机构的命令或第三方的不作为而造成的不能服务或延迟服务承担责任。
              </li>
            </ul>
          </div>
          <h2 class="text-base font-bold text-center text-slate-400 dark:text-neutral-200">
            十、用户行为准则
          </h2>
          <div class="disclaimer-container">
            <ul>
              <li>
                10.1 您在使用本平台服务时，必须遵循国家的相关法律法规，不得利用本平台服务制作、上传、复制、发布、传播或者转载如下内容： 反动、邪教内容，或者其他违反国家法律的内容； 进行商业广告行为； 侵害他人知识产权的内容； 侵害他人隐私权、名誉权等合法权益的内容。
              </li>
              <li>
                10.2 本平台可能包含第三方提供的信息或第三方网站，您可能会从本平台链接到第三方网站。本平台对第三方网站的内容无权控制，不保证其真实性、有效性、合法性。链接到第三方网站并不代表本平台对其网站内容的认可或负责。
              </li>
            </ul>
          </div>

          <h2 class="text-base font-bold text-center text-slate-400 dark:text-neutral-200">
            十一、终止与解除
          </h2>
          <div class="disclaimer-container">
            <ul>
              <li>
                11.1 您同意本平台出于自身商业考虑，可在提前通知或未提前通知的情况下终止全部或部分平台服务，对于服务的终止，本平台应尽可能早地通知您，并尽可能减少对您的影响。
              </li>
              <li>
                11.2 因您违反本用户协议的任何条款，本平台有权依据协议终止对您的服务。同时，本平台对您或任何第三方不承担责任。
              </li>
            </ul>
          </div>

          <h2 class="text-base font-bold text-center text-slate-400 dark:text-neutral-200">
            十二、法律适用与争议解决
          </h2>
          <div class="disclaimer-container">
            <ul>
              <li>
                12.1 本协议之效力、解释、变更、执行与争议解决均适用中华人民共和国法律。
              </li>
              <li>
                12.2 若您和本平台之间发生任何纠纷或争议，首先应友好协商解决，协商不成的，双方同意提交本平台所在地的有管辖权的人民法院解决。
              </li>
            </ul>
          </div>
        </div>
      </header>
    </div>
  </div>
</template>

<style scoped>
.disclaimer-container {
  max-width: 600px;
  margin: 10px auto; /* 使容器在页面中居中 */
  padding: 10px;
  text-align: left; /* 确保容器内的所有文本靠左对齐 */
}

ul {
  list-style-type: none;
  padding-left: 0; /* 移除默认的缩进 */
  margin-left: auto;
  margin-right: auto; /* 使列表在容器中居中 */
}

li {
  margin-bottom: 10px;
  text-align: left; /* 确保列表项中的文本靠左对齐 */
}
</style>
